# RIP (Routing Information Protocol)

## ğŸ“ ê°œìš”
RIPëŠ” ê°€ì¥ ì˜¤ë˜ëœ ê±°ë¦¬ ë²¡í„°(Distance Vector) ë¼ìš°íŒ… í”„ë¡œí† ì½œ ì¤‘ í•˜ë‚˜ë¡œ, í™‰ ì¹´ìš´íŠ¸ë¥¼ ë©”íŠ¸ë¦­ìœ¼ë¡œ ì‚¬ìš©í•˜ëŠ” ê°„ë‹¨í•œ IGP(Interior Gateway Protocol)ì…ë‹ˆë‹¤.

## ğŸ¯ RIPì˜ íŠ¹ì§•

### ê¸°ë³¸ íŠ¹ì„±
- **í”„ë¡œí† ì½œ íƒ€ì…**: Distance Vector
- **ë©”íŠ¸ë¦­**: í™‰ ì¹´ìš´íŠ¸ (Hop Count)
- **ìµœëŒ€ í™‰ ì¹´ìš´íŠ¸**: 15 (16ì€ ë¬´í•œëŒ€ë¡œ ê°„ì£¼)
- **ì—…ë°ì´íŠ¸ ì£¼ê¸°**: 30ì´ˆë§ˆë‹¤ ì •ê¸° ì—…ë°ì´íŠ¸
- **AD (Administrative Distance)**: 120

### RIP ë²„ì „ ë¹„êµ
| íŠ¹ì§• | RIPv1 | RIPv2 |
|------|-------|-------|
| **RFC** | RFC 1058 | RFC 2453 |
| **í´ë˜ìŠ¤** | Classful | Classless |
| **VLSM ì§€ì›** | ë¯¸ì§€ì› | ì§€ì› |
| **ì¸ì¦** | ë¯¸ì§€ì› | ì§€ì› |
| **ë©€í‹°ìºìŠ¤íŠ¸** | ë¸Œë¡œë“œìºìŠ¤íŠ¸ | 224.0.0.9 |
| **ë¼ìš°íŠ¸ íƒœê¹…** | ë¯¸ì§€ì› | ì§€ì› |

## ğŸ”„ RIP ë™ì‘ ì›ë¦¬

### Distance Vector ì•Œê³ ë¦¬ì¦˜
```
Bellman-Ford ì•Œê³ ë¦¬ì¦˜ ê¸°ë°˜:
1. ì´ˆê¸°í™”: ì§ì ‘ ì—°ê²°ëœ ë„¤íŠ¸ì›Œí¬ë§Œ ì•Œê³  ìˆìŒ
2. ì •ë³´ êµí™˜: ì¸ì ‘ ë¼ìš°í„°ì™€ ë¼ìš°íŒ… ì •ë³´ êµí™˜
3. ê²½ë¡œ ê³„ì‚°: ë” ë‚˜ì€ ê²½ë¡œ ë°œê²¬ ì‹œ ì—…ë°ì´íŠ¸
4. ìˆ˜ë ´: ëª¨ë“  ë¼ìš°í„°ê°€ ì¼ê´€ëœ ë¼ìš°íŒ… ì •ë³´ ìœ ì§€
```

### ì—…ë°ì´íŠ¸ ê³¼ì •
```
1. ì •ê¸° ì—…ë°ì´íŠ¸ (30ì´ˆ)
   - ì „ì²´ ë¼ìš°íŒ… í…Œì´ë¸” ì „ì†¡
   - UDP í¬íŠ¸ 520 ì‚¬ìš©

2. íŠ¸ë¦¬ê±° ì—…ë°ì´íŠ¸
   - í† í´ë¡œì§€ ë³€í™” ì‹œ ì¦‰ì‹œ ì „ì†¡
   - ìˆ˜ë ´ ì‹œê°„ ë‹¨ì¶•

3. ì—…ë°ì´íŠ¸ ì²˜ë¦¬
   - Split Horizon ì ìš©
   - Poison Reverse ì²˜ë¦¬
   - í™‰ ì¹´ìš´íŠ¸ ì¦ê°€
```

## â° RIP íƒ€ì´ë¨¸

### ê¸°ë³¸ íƒ€ì´ë¨¸
| íƒ€ì´ë¨¸ | ê¸°ë³¸ê°’ | ì„¤ëª… |
|--------|--------|------|
| **Update Timer** | 30ì´ˆ | ì •ê¸° ì—…ë°ì´íŠ¸ ê°„ê²© |
| **Invalid Timer** | 180ì´ˆ | ì—…ë°ì´íŠ¸ ì—†ìœ¼ë©´ invalid ìƒíƒœ |
| **Holddown Timer** | 180ì´ˆ | ìƒˆ ì •ë³´ ìˆ˜ìš© ëŒ€ê¸° ì‹œê°„ |
| **Flush Timer** | 240ì´ˆ | ë¼ìš°íŒ… í…Œì´ë¸”ì—ì„œ ì™„ì „ ì‚­ì œ |

### íƒ€ì´ë¨¸ ì„¤ì •
```cisco
Router(config)# router rip
Router(config-router)# timers basic update invalid holddown flush
Router(config-router)# timers basic 30 180 180 240  # ê¸°ë³¸ê°’
```

## ğŸš« ë£¨í”„ ë°©ì§€ ë©”ì»¤ë‹ˆì¦˜

### Split Horizon
```
ì›ë¦¬: ì •ë³´ë¥¼ ë°›ì€ ì¸í„°í˜ì´ìŠ¤ë¡œ ê°™ì€ ì •ë³´ë¥¼ ë‹¤ì‹œ ë³´ë‚´ì§€ ì•ŠìŒ

ì˜ˆì‹œ:
R1 â†’ R2: "ë„¤íŠ¸ì›Œí¬ Aì— ë„ë‹¬í•˜ë ¤ë©´ ë‚˜ë¥¼ ê±°ì³ë¼"
R2ëŠ” ì´ ì •ë³´ë¥¼ R1ìœ¼ë¡œ ë‹¤ì‹œ ë³´ë‚´ì§€ ì•ŠìŒ
```

### Poison Reverse
```
ì›ë¦¬: ë„ë‹¬ ë¶ˆê°€ëŠ¥í•œ ë„¤íŠ¸ì›Œí¬ë¥¼ í™‰ ì¹´ìš´íŠ¸ 16ìœ¼ë¡œ ê´‘ê³ 

ì˜ˆì‹œ:
ë„¤íŠ¸ì›Œí¬ A ì¥ì•  ì‹œ:
R1 â†’ R2: "ë„¤íŠ¸ì›Œí¬ Aì˜ í™‰ ì¹´ìš´íŠ¸ëŠ” 16 (ë¬´í•œëŒ€)"
```

### Hold-down Timer
```
ì›ë¦¬: ë„¤íŠ¸ì›Œí¬ê°€ downëœ í›„ ì¼ì • ì‹œê°„ ë™ì•ˆ ìƒˆë¡œìš´ ì •ë³´ ë¬´ì‹œ

ê³¼ì •:
1. ë„¤íŠ¸ì›Œí¬ ì¥ì•  ê°ì§€
2. Hold-down íƒ€ì´ë¨¸ ì‹œì‘ (180ì´ˆ)
3. íƒ€ì´ë¨¸ ë§Œë£Œ ì „ê¹Œì§€ ë” ë‚˜ìœ ì •ë³´ ë¬´ì‹œ
4. íƒ€ì´ë¨¸ ë§Œë£Œ í›„ ìƒˆë¡œìš´ ì •ë³´ ìˆ˜ìš©
```

## âš™ï¸ RIP ì„¤ì •

### RIPv1 ì„¤ì •
```cisco
# RIP í™œì„±í™”
Router(config)# router rip
Router(config-router)# version 1

# ë„¤íŠ¸ì›Œí¬ ì„ ì–¸ (í´ë˜ìŠ¤í’€ ì£¼ì†Œë§Œ)
Router(config-router)# network 192.168.1.0
Router(config-router)# network 10.0.0.0

# ìˆ˜ë™ ìš”ì•½ (ìë™ ìš”ì•½ ê¸°ë³¸ í™œì„±í™”)
Router(config-router)# auto-summary
```

### RIPv2 ì„¤ì •
```cisco
# RIPv2 í™œì„±í™”
Router(config)# router rip
Router(config-router)# version 2

# ë„¤íŠ¸ì›Œí¬ ì„ ì–¸
Router(config-router)# network 192.168.1.0
Router(config-router)# network 10.0.0.0

# ìë™ ìš”ì•½ ë¹„í™œì„±í™” (VLSM ì§€ì›)
Router(config-router)# no auto-summary
```

### ê³ ê¸‰ ì„¤ì • ì˜µì…˜
```cisco
# ìˆ˜ë™ ìš”ì•½
Router(config)# interface serial0/0/0
Router(config-if)# ip summary-address rip 192.168.0.0 255.255.252.0

# RIP ë¹„í™œì„±í™” (íŠ¹ì • ì¸í„°í˜ì´ìŠ¤)
Router(config-router)# passive-interface fastethernet0/0

# ìœ ë‹ˆìºìŠ¤íŠ¸ neighbor
Router(config-router)# neighbor 10.1.1.2

# ê¸°ë³¸ ê²½ë¡œ ì „íŒŒ
Router(config-router)# default-information originate

# ìµœëŒ€ ê²½ë¡œ ìˆ˜ ì„¤ì •
Router(config-router)# maximum-paths 4
```

## ğŸ” RIPv2 ì¸ì¦

### í‰ë¬¸ ì¸ì¦ (Plain Text)
```cisco
# í‚¤ ì²´ì¸ ìƒì„±
Router(config)# key chain RIP_KEYS
Router(config-keychain)# key 1
Router(config-keychain-key)# key-string cisco123

# ì¸í„°í˜ì´ìŠ¤ ì ìš©
Router(config)# interface serial0/0/0
Router(config-if)# ip rip authentication mode text
Router(config-if)# ip rip authentication key-chain RIP_KEYS
```

### MD5 ì¸ì¦
```cisco
# í‚¤ ì²´ì¸ ìƒì„±
Router(config)# key chain RIP_KEYS
Router(config-keychain)# key 1
Router(config-keychain-key)# key-string cisco123

# ì¸í„°í˜ì´ìŠ¤ ì ìš©
Router(config)# interface serial0/0/0
Router(config-if)# ip rip authentication mode md5
Router(config-if)# ip rip authentication key-chain RIP_KEYS
```

## ğŸ“Š RIP í™•ì¸ ë° ëª¨ë‹ˆí„°ë§

### ê¸°ë³¸ í™•ì¸ ëª…ë ¹ì–´
```cisco
# RIP êµ¬ì„± ì •ë³´
Router# show ip protocols

# RIP ë°ì´í„°ë² ì´ìŠ¤
Router# show ip rip database

# ë¼ìš°íŒ… í…Œì´ë¸” (RIP ê²½ë¡œë§Œ)
Router# show ip route rip

# RIP ì¸í„°í˜ì´ìŠ¤ ì •ë³´
Router# show ip interface brief
```

### ìƒì„¸ ì •ë³´ í™•ì¸
```cisco
# ìƒì„¸ RIP ì •ë³´
Router# show ip protocols

Output:
Routing Protocol is "rip"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Sending updates every 30 seconds, next due in 22 seconds
  Invalid after 180 seconds, hold down 180, flushed after 240
  Redistributing: rip
  Default version control: send version 2, receive version 2
    Interface             Send  Recv  Triggered RIP  Key-chain
    Serial0/0/0           2     2                     
    FastEthernet0/0       2     2                     
  Automatic network summarization is not in effect
  Maximum path: 4
  Routing for Networks:
    10.0.0.0
    192.168.1.0
  Routing Information Sources:
    Gateway         Distance      Last Update
    10.1.1.2            120      00:00:24
  Distance: (default is 120)
```

## ğŸ› ë””ë²„ê¹…ê³¼ ë¬¸ì œí•´ê²°

### ë””ë²„ê¹… ëª…ë ¹ì–´
```cisco
# RIP ì´ë²¤íŠ¸ ë””ë²„ê·¸
Router# debug ip rip events

# RIP íŒ¨í‚· ë””ë²„ê·¸
Router# debug ip rip

# RIP ë°ì´í„°ë² ì´ìŠ¤ ë””ë²„ê·¸
Router# debug ip rip database

# ë””ë²„ê·¸ ì¢…ë£Œ
Router# undebug all
```

### ì¼ë°˜ì ì¸ ë¬¸ì œë“¤

#### 1. ì´ì›ƒ ê´€ê³„ í˜•ì„± ì‹¤íŒ¨
```
ë¬¸ì œ: RIP ì—…ë°ì´íŠ¸ ìˆ˜ì‹  ì•ˆë¨
ì›ì¸:
- ë„¤íŠ¸ì›Œí¬ ëª…ë ¹ì–´ ëˆ„ë½
- ë²„ì „ ë¶ˆì¼ì¹˜
- ì¸ì¦ ì„¤ì • ì˜¤ë¥˜

í•´ê²°:
1. show ip protocolsë¡œ ì„¤ì • í™•ì¸
2. debug ip ripë¡œ íŒ¨í‚· í™•ì¸
3. ë„¤íŠ¸ì›Œí¬ ëª…ë ¹ì–´ ì¬ì„¤ì •
```

#### 2. ê²½ë¡œ í•™ìŠµ ì‹¤íŒ¨
```
ë¬¸ì œ: ì›ê²© ë„¤íŠ¸ì›Œí¬ í•™ìŠµ ì•ˆë¨
ì›ì¸:
- ìë™ ìš”ì•½ ë¬¸ì œ
- Split Horizon ë¬¸ì œ
- í•„í„°ë§ ì„¤ì •

í•´ê²°:
1. no auto-summary ì„¤ì •
2. ì¸í„°í˜ì´ìŠ¤ë³„ RIP ì„¤ì • í™•ì¸
3. ì ‘ê·¼ ëª©ë¡ í™•ì¸
```

#### 3. ëŠë¦° ìˆ˜ë ´
```
ë¬¸ì œ: í† í´ë¡œì§€ ë³€í™” ì‹œ ì˜¤ëœ ìˆ˜ë ´ ì‹œê°„
ì›ì¸: RIPì˜ ê¸°ë³¸ì ì¸ í•œê³„

í•´ê²°:
1. íƒ€ì´ë¨¸ ì¡°ì • (ì‹ ì¤‘í•˜ê²Œ)
2. ë‹¤ë¥¸ ë¼ìš°íŒ… í”„ë¡œí† ì½œ ê³ ë ¤
3. ë„¤íŠ¸ì›Œí¬ ì„¤ê³„ ê°œì„ 
```

## ğŸš€ RIP ìµœì í™”

### ì„±ëŠ¥ ê°œì„  ë°©ë²•
```cisco
# íƒ€ì´ë¨¸ ìµœì í™” (ì‹ ì¤‘í•˜ê²Œ ì ìš©)
Router(config-router)# timers basic 15 90 90 120

# ë¶ˆí•„ìš”í•œ ì—…ë°ì´íŠ¸ ë°©ì§€
Router(config-router)# passive-interface default
Router(config-router)# no passive-interface serial0/0/0

# ìˆ˜ë™ ìš”ì•½ìœ¼ë¡œ ë¼ìš°íŒ… í…Œì´ë¸” í¬ê¸° ì¶•ì†Œ
Router(config-if)# ip summary-address rip 192.168.0.0 255.255.248.0
```

### ë¼ìš°íŠ¸ í•„í„°ë§
```cisco
# ë°°í¬ ëª©ë¡ (distribute-list)
Router(config)# access-list 10 deny 192.168.10.0 0.0.0.255
Router(config)# access-list 10 permit any

Router(config)# router rip
Router(config-router)# distribute-list 10 out serial0/0/0

# ë¼ìš°íŠ¸ ë§µ ì‚¬ìš©
Router(config)# route-map FILTER_ROUTES permit 10
Router(config-route-map)# match ip address 10

Router(config)# router rip
Router(config-router)# distribute-list route-map FILTER_ROUTES out
```

## ğŸŒ RIPê³¼ ë‹¤ë¥¸ í”„ë¡œí† ì½œ ë¹„êµ

### í”„ë¡œí† ì½œ ë¹„êµí‘œ
| íŠ¹ì§• | RIP | OSPF | EIGRP |
|------|-----|------|-------|
| **íƒ€ì…** | Distance Vector | Link State | Advanced Distance Vector |
| **ë©”íŠ¸ë¦­** | í™‰ ì¹´ìš´íŠ¸ | Cost | Composite |
| **ìˆ˜ë ´ ì†ë„** | ëŠë¦¼ | ë¹ ë¦„ | ë¹ ë¦„ |
| **í™•ì¥ì„±** | ì œí•œì  | ë†’ìŒ | ë†’ìŒ |
| **CPU ì‚¬ìš©** | ë‚®ìŒ | ë†’ìŒ | ì¤‘ê°„ |
| **ë©”ëª¨ë¦¬ ì‚¬ìš©** | ë‚®ìŒ | ë†’ìŒ | ì¤‘ê°„ |

### ì‚¬ìš© ì‚¬ë¡€
```
RIP ì í•©í•œ ê²½ìš°:
âœ… ì†Œê·œëª¨ ë„¤íŠ¸ì›Œí¬ (< 15 í™‰)
âœ… ë‹¨ìˆœí•œ í† í´ë¡œì§€
âœ… ì œí•œëœ í•˜ë“œì›¨ì–´ ë¦¬ì†ŒìŠ¤
âœ… í•™ìŠµ/í…ŒìŠ¤íŠ¸ ëª©ì 

RIP ë¶€ì í•©í•œ ê²½ìš°:
âŒ ëŒ€ê·œëª¨ ë„¤íŠ¸ì›Œí¬
âŒ ë³µì¡í•œ í† í´ë¡œì§€
âŒ ë¹ ë¥¸ ìˆ˜ë ´ ìš”êµ¬
âŒ ì •ë°€í•œ ê²½ë¡œ ì œì–´ í•„ìš”
```

## ğŸ“‹ ì„¤ì • ì˜ˆì‹œ

### ê¸°ë³¸ ë„¤íŠ¸ì›Œí¬ ì„¤ì •
```
í† í´ë¡œì§€:
R1 [192.168.1.0/24] --- [10.1.1.0/30] --- R2 [192.168.2.0/24]
```

#### R1 ì„¤ì •
```cisco
Router> enable
Router# configure terminal
Router(config)# hostname R1
R1(config)# interface fastethernet0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# no shutdown

R1(config)# interface serial0/0/0
R1(config-if)# ip address 10.1.1.1 255.255.255.252
R1(config-if)# no shutdown

R1(config)# router rip
R1(config-router)# version 2
R1(config-router)# no auto-summary
R1(config-router)# network 192.168.1.0
R1(config-router)# network 10.0.0.0
```

#### R2 ì„¤ì •
```cisco
Router> enable
Router# configure terminal
Router(config)# hostname R2
R2(config)# interface fastethernet0/0
R2(config-if)# ip address 192.168.2.1 255.255.255.0
R2(config-if)# no shutdown

R2(config)# interface serial0/0/0
R2(config-if)# ip address 10.1.1.2 255.255.255.252
R2(config-if)# no shutdown

R2(config)# router rip
R2(config-router)# version 2
R2(config-router)# no auto-summary
R2(config-router)# network 192.168.2.0
R2(config-router)# network 10.0.0.0
```

## ğŸ”— ê´€ë ¨ ì£¼ì œ
- [[ë¼ìš°íŒ… ê¸°ì´ˆ|ë¼ìš°íŒ…]] - ë¼ìš°íŒ…ì˜ ê¸°ë³¸ ê°œë…
- [[OSPF|OSPF]] - ë§í¬ ìƒíƒœ í”„ë¡œí† ì½œ
- [[EIGRP|EIGRP]] - Cisco ê³ ê¸‰ í”„ë¡œí† ì½œ
- [[ì •ì  ë¼ìš°íŒ…|ì •ì  ë¼ìš°íŒ…]] - ìˆ˜ë™ ë¼ìš°íŒ…ê³¼ ë¹„êµ

## ğŸ·ï¸ íƒœê·¸
#ccna #rip #ë¼ìš°íŒ…í”„ë¡œí† ì½œ #distance-vector #igp #ë™ì ë¼ìš°íŒ… #í™‰ì¹´ìš´íŠ¸