# 포트 보안 (Port Security)

## 📝 개요
포트 보안은 스위치 포트에 연결할 수 있는 MAC 주소를 제한하여 네트워크 보안을 강화하는 기능입니다. 허가되지 않은 장치의 네트워크 접근을 방지하고 MAC 주소 기반 공격을 차단합니다.

## 🎯 포트 보안의 목적

### 보안 강화
- **불법 접속 방지**: 허가되지 않은 장치 차단
- **MAC 플러딩 공격 방지**: CAM 테이블 오버플로우 차단
- **물리적 보안**: 케이블 도청 방지

### 네트워크 제어
- **장치 수 제한**: 포트당 연결 장치 개수 제한
- **특정 장치만 허용**: MAC 주소 화이트리스트
- **동적 학습 제어**: 자동 MAC 주소 학습 관리

## 🔧 포트 보안 구성 요소

### Maximum MAC Addresses
```
기본값: 1개
범위: 1-8192개 (모델에 따라 다름)
권장: 필요한 최소 개수로 설정
```

### Secure MAC Addresses 유형
#### Static Secure MAC
```cisco
# 정적 보안 MAC 주소 설정
Switch(config)# interface fa0/1
Switch(config-if)# switchport port-security mac-address 1234.5678.9abc
```

#### Dynamic Secure MAC  
```cisco
# 동적 학습 (기본값)
# 첫 번째로 학습된 MAC 주소가 보안 MAC이 됨
# 스위치 재부팅 시 삭제됨
```

#### Sticky Secure MAC
```cisco
# Sticky 학습 설정
Switch(config-if)# switchport port-security mac-address sticky

# 자동으로 running-config에 추가됨
# copy running-config startup-config로 영구 저장 필요
```

## ⚠️ Violation Actions (위반 시 동작)

### Protect Mode
```
동작: 위반 트래픽만 차단
특징:
- 포트는 계속 활성 상태
- 허가된 트래픽은 정상 처리
- 로그 생성 안함
- 카운터 증가 안함

설정:
Switch(config-if)# switchport port-security violation protect
```

### Restrict Mode
```
동작: 위반 트래픽 차단 + 알림
특징:
- 포트는 계속 활성 상태
- 허가된 트래픽은 정상 처리
- SNMP 트랩 및 syslog 생성
- 위반 카운터 증가

설정:
Switch(config-if)# switchport port-security violation restrict
```

### Shutdown Mode (기본값)
```
동작: 포트 완전 차단
특징:
- 포트를 err-disabled 상태로 변경
- 모든 트래픽 차단
- SNMP 트랩 및 syslog 생성
- 수동 복구 필요

설정:
Switch(config-if)# switchport port-security violation shutdown
```

## 🛠️ 포트 보안 설정

### 기본 설정
```cisco
# 인터페이스를 액세스 모드로 설정
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport mode access

# 포트 보안 활성화
Switch(config-if)# switchport port-security

# 최대 MAC 주소 수 설정
Switch(config-if)# switchport port-security maximum 2

# 위반 시 동작 설정
Switch(config-if)# switchport port-security violation restrict

# (선택사항) 특정 MAC 주소 허용
Switch(config-if)# switchport port-security mac-address 1111.2222.3333
```

### Sticky MAC 설정
```cisco
Switch(config)# interface fastethernet 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 3
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security violation shutdown
```

### 여러 포트 동시 설정
```cisco
Switch(config)# interface range fa0/1-10
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport port-security
Switch(config-if-range)# switchport port-security maximum 1
Switch(config-if-range)# switchport port-security violation shutdown
```

## 📊 포트 보안 확인 및 모니터링

### 확인 명령어
```cisco
# 전체 포트 보안 정보
Switch# show port-security

# 특정 인터페이스 정보
Switch# show port-security interface fa0/1

# 보안 MAC 주소 테이블
Switch# show port-security address

# 위반 정보 확인
Switch# show port-security interface fa0/1 address
```

### 출력 예시
```
Switch# show port-security interface fa0/1

Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 2
Total MAC Addresses        : 1
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 1
Last Source Address:Vlan   : 1111.2222.3333:1
Security Violation Count   : 0
```

### 에러 상태 확인
```cisco
# err-disabled 상태 확인
Switch# show interfaces status err-disabled

# err-disabled 원인 확인
Switch# show errdisable recovery
```

## 🔄 에러 복구

### 수동 복구
```cisco
# 포트 다운 후 다시 활성화
Switch(config)# interface fa0/1
Switch(config-if)# shutdown
Switch(config-if)# no shutdown
```

### 자동 복구 설정
```cisco
# err-disabled 자동 복구 활성화
Switch(config)# errdisable recovery cause psecure-violation

# 복구 시간 설정 (기본: 300초)
Switch(config)# errdisable recovery interval 120
```

### MAC 주소 삭제
```cisco
# 특정 보안 MAC 주소 삭제
Switch(config)# interface fa0/1
Switch(config-if)# no switchport port-security mac-address 1111.2222.3333

# 모든 동적 보안 MAC 주소 삭제
Switch# clear port-security dynamic

# 특정 인터페이스의 동적 MAC 삭제
Switch# clear port-security dynamic interface fa0/1

# Sticky MAC 주소 삭제
Switch# clear port-security sticky interface fa0/1
```

## ⏰ MAC 주소 에이징

### 에이징 설정
```cisco
# 에이징 시간 설정 (분 단위)
Switch(config-if)# switchport port-security aging time 60

# 에이징 타입 설정
Switch(config-if)# switchport port-security aging type absolute
# 또는
Switch(config-if)# switchport port-security aging type inactivity

# 정적 MAC 주소 에이징 활성화
Switch(config-if)# switchport port-security aging static
```

### 에이징 타입
| 타입 | 설명 |
|------|------|
| **Absolute** | 설정된 시간 후 무조건 삭제 |
| **Inactivity** | 비활성 시간 후 삭제 |

## 🚨 문제해결

### 일반적인 문제들

#### 1. 포트 보안 활성화 실패
```
문제: switchport port-security 명령어 실패
원인: 트렁크 모드에서는 포트 보안 불가

해결:
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
```

#### 2. MAC 주소 학습 실패
```
문제: Sticky MAC이 학습되지 않음
원인: 이미 최대 개수에 도달

확인:
show port-security interface fa0/1

해결:
- 최대 개수 증가 또는
- 기존 MAC 주소 삭제
```

#### 3. 예상치 못한 위반
```
문제: 정상 장치에서 위반 발생
원인: 
- VM의 MAC 주소 변경
- NIC 교체
- 멀티홈 장치

해결:
- MAC 주소 재확인
- Sticky 설정 재구성
```

### 문제해결 단계
```cisco
# 1. 현재 상태 확인
show port-security interface fa0/1

# 2. MAC 주소 테이블 확인
show mac address-table interface fa0/1

# 3. 인터페이스 상태 확인
show interfaces fa0/1 status

# 4. 설정 확인
show running-config interface fa0/1

# 5. 로그 확인
show logging | include PSECURE
```

## 🏢 실무 적용 시나리오

### 사무실 환경
```cisco
# 일반 사용자 포트 (1개 장치)
interface range fa0/1-20
 switchport mode access
 switchport access vlan 10
 switchport port-security
 switchport port-security maximum 1
 switchport port-security mac-address sticky
 switchport port-security violation shutdown
 spanning-tree portfast
```

### 회의실/교육실
```cisco
# 다중 장치 연결 가능 (노트북 + 전화기)
interface range fa0/21-24
 switchport mode access
 switchport access vlan 20
 switchport port-security
 switchport port-security maximum 3
 switchport port-security violation restrict
 switchport port-security aging time 60
 switchport port-security aging type inactivity
```

### 서버실/중요 장비
```cisco
# 고정 MAC 주소 설정
interface gi0/1
 switchport mode access
 switchport access vlan 100
 switchport port-security
 switchport port-security maximum 1
 switchport port-security mac-address 1111.2222.3333
 switchport port-security violation shutdown
```

## 🛡️ 보안 모범 사례

### 설정 권장사항
```
1. 액세스 포트에서만 사용
2. 필요한 최소 MAC 개수로 제한
3. Sticky 학습 활용
4. 적절한 위반 모드 선택
5. 에이징 정책 설정
6. 자동 복구 설정 고려
```

### 보안 강화 방법
```cisco
# 1. 미사용 포트 비활성화
interface range fa0/11-24
 shutdown
 switchport mode access
 switchport access vlan 999

# 2. Native VLAN 변경
vlan 999
 name UNUSED
interface fa0/24
 switchport trunk native vlan 999

# 3. 포트 보안과 802.1X 연동
interface fa0/1
 switchport mode access
 switchport port-security
 authentication host-mode multi-domain
 authentication port-control auto
```

## 📋 체크리스트

### 설정 전 점검사항
- [ ] 인터페이스가 액세스 모드인가?
- [ ] 연결될 장치 수는 몇 개인가?
- [ ] 고정 MAC 주소가 필요한가?
- [ ] 위반 시 어떻게 처리할 것인가?
- [ ] 자동 복구가 필요한가?

### 설정 후 확인사항
- [ ] 포트 보안이 활성화되었는가?
- [ ] MAC 주소가 올바르게 학습되었는가?
- [ ] 위반 테스트를 수행했는가?
- [ ] 복구 절차를 문서화했는가?

## 🔗 관련 주제
- [[스위치 동작원리|스위칭]] - MAC 주소 학습 원리
- [[VLAN 구성|VLAN]] - 액세스 포트와 VLAN
- [[네트워크 보안|보안]] - 전체적인 보안 전략
- [[802.1X 인증|인증]] - 포트 기반 네트워크 접근 제어

## 🏷️ 태그
#ccna #포트보안 #스위치보안 #mac주소 #네트워크보안 #접근제어 #스위칭