# í¬íŠ¸ ë³´ì•ˆ (Port Security)

## ğŸ“ ê°œìš”
í¬íŠ¸ ë³´ì•ˆì€ ìŠ¤ìœ„ì¹˜ í¬íŠ¸ì— ì—°ê²°í•  ìˆ˜ ìˆëŠ” MAC ì£¼ì†Œë¥¼ ì œí•œí•˜ì—¬ ë„¤íŠ¸ì›Œí¬ ë³´ì•ˆì„ ê°•í™”í•˜ëŠ” ê¸°ëŠ¥ì…ë‹ˆë‹¤. í—ˆê°€ë˜ì§€ ì•Šì€ ì¥ì¹˜ì˜ ë„¤íŠ¸ì›Œí¬ ì ‘ê·¼ì„ ë°©ì§€í•˜ê³  MAC ì£¼ì†Œ ê¸°ë°˜ ê³µê²©ì„ ì°¨ë‹¨í•©ë‹ˆë‹¤.

## ğŸ¯ í¬íŠ¸ ë³´ì•ˆì˜ ëª©ì 

### ë³´ì•ˆ ê°•í™”
- **ë¶ˆë²• ì ‘ì† ë°©ì§€**: í—ˆê°€ë˜ì§€ ì•Šì€ ì¥ì¹˜ ì°¨ë‹¨
- **MAC í”ŒëŸ¬ë”© ê³µê²© ë°©ì§€**: CAM í…Œì´ë¸” ì˜¤ë²„í”Œë¡œìš° ì°¨ë‹¨
- **ë¬¼ë¦¬ì  ë³´ì•ˆ**: ì¼€ì´ë¸” ë„ì²­ ë°©ì§€

### ë„¤íŠ¸ì›Œí¬ ì œì–´
- **ì¥ì¹˜ ìˆ˜ ì œí•œ**: í¬íŠ¸ë‹¹ ì—°ê²° ì¥ì¹˜ ê°œìˆ˜ ì œí•œ
- **íŠ¹ì • ì¥ì¹˜ë§Œ í—ˆìš©**: MAC ì£¼ì†Œ í™”ì´íŠ¸ë¦¬ìŠ¤íŠ¸
- **ë™ì  í•™ìŠµ ì œì–´**: ìë™ MAC ì£¼ì†Œ í•™ìŠµ ê´€ë¦¬

## ğŸ”§ í¬íŠ¸ ë³´ì•ˆ êµ¬ì„± ìš”ì†Œ

### Maximum MAC Addresses
```
ê¸°ë³¸ê°’: 1ê°œ
ë²”ìœ„: 1-8192ê°œ (ëª¨ë¸ì— ë”°ë¼ ë‹¤ë¦„)
ê¶Œì¥: í•„ìš”í•œ ìµœì†Œ ê°œìˆ˜ë¡œ ì„¤ì •
```

### Secure MAC Addresses ìœ í˜•
#### Static Secure MAC
```cisco
# ì •ì  ë³´ì•ˆ MAC ì£¼ì†Œ ì„¤ì •
Switch(config)# interface fa0/1
Switch(config-if)# switchport port-security mac-address 1234.5678.9abc
```

#### Dynamic Secure MAC  
```cisco
# ë™ì  í•™ìŠµ (ê¸°ë³¸ê°’)
# ì²« ë²ˆì§¸ë¡œ í•™ìŠµëœ MAC ì£¼ì†Œê°€ ë³´ì•ˆ MACì´ ë¨
# ìŠ¤ìœ„ì¹˜ ì¬ë¶€íŒ… ì‹œ ì‚­ì œë¨
```

#### Sticky Secure MAC
```cisco
# Sticky í•™ìŠµ ì„¤ì •
Switch(config-if)# switchport port-security mac-address sticky

# ìë™ìœ¼ë¡œ running-configì— ì¶”ê°€ë¨
# copy running-config startup-configë¡œ ì˜êµ¬ ì €ì¥ í•„ìš”
```

## âš ï¸ Violation Actions (ìœ„ë°˜ ì‹œ ë™ì‘)

### Protect Mode
```
ë™ì‘: ìœ„ë°˜ íŠ¸ë˜í”½ë§Œ ì°¨ë‹¨
íŠ¹ì§•:
- í¬íŠ¸ëŠ” ê³„ì† í™œì„± ìƒíƒœ
- í—ˆê°€ëœ íŠ¸ë˜í”½ì€ ì •ìƒ ì²˜ë¦¬
- ë¡œê·¸ ìƒì„± ì•ˆí•¨
- ì¹´ìš´í„° ì¦ê°€ ì•ˆí•¨

ì„¤ì •:
Switch(config-if)# switchport port-security violation protect
```

### Restrict Mode
```
ë™ì‘: ìœ„ë°˜ íŠ¸ë˜í”½ ì°¨ë‹¨ + ì•Œë¦¼
íŠ¹ì§•:
- í¬íŠ¸ëŠ” ê³„ì† í™œì„± ìƒíƒœ
- í—ˆê°€ëœ íŠ¸ë˜í”½ì€ ì •ìƒ ì²˜ë¦¬
- SNMP íŠ¸ë© ë° syslog ìƒì„±
- ìœ„ë°˜ ì¹´ìš´í„° ì¦ê°€

ì„¤ì •:
Switch(config-if)# switchport port-security violation restrict
```

### Shutdown Mode (ê¸°ë³¸ê°’)
```
ë™ì‘: í¬íŠ¸ ì™„ì „ ì°¨ë‹¨
íŠ¹ì§•:
- í¬íŠ¸ë¥¼ err-disabled ìƒíƒœë¡œ ë³€ê²½
- ëª¨ë“  íŠ¸ë˜í”½ ì°¨ë‹¨
- SNMP íŠ¸ë© ë° syslog ìƒì„±
- ìˆ˜ë™ ë³µêµ¬ í•„ìš”

ì„¤ì •:
Switch(config-if)# switchport port-security violation shutdown
```

## ğŸ› ï¸ í¬íŠ¸ ë³´ì•ˆ ì„¤ì •

### ê¸°ë³¸ ì„¤ì •
```cisco
# ì¸í„°í˜ì´ìŠ¤ë¥¼ ì•¡ì„¸ìŠ¤ ëª¨ë“œë¡œ ì„¤ì •
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport mode access

# í¬íŠ¸ ë³´ì•ˆ í™œì„±í™”
Switch(config-if)# switchport port-security

# ìµœëŒ€ MAC ì£¼ì†Œ ìˆ˜ ì„¤ì •
Switch(config-if)# switchport port-security maximum 2

# ìœ„ë°˜ ì‹œ ë™ì‘ ì„¤ì •
Switch(config-if)# switchport port-security violation restrict

# (ì„ íƒì‚¬í•­) íŠ¹ì • MAC ì£¼ì†Œ í—ˆìš©
Switch(config-if)# switchport port-security mac-address 1111.2222.3333
```

### Sticky MAC ì„¤ì •
```cisco
Switch(config)# interface fastethernet 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 3
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security violation shutdown
```

### ì—¬ëŸ¬ í¬íŠ¸ ë™ì‹œ ì„¤ì •
```cisco
Switch(config)# interface range fa0/1-10
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport port-security
Switch(config-if-range)# switchport port-security maximum 1
Switch(config-if-range)# switchport port-security violation shutdown
```

## ğŸ“Š í¬íŠ¸ ë³´ì•ˆ í™•ì¸ ë° ëª¨ë‹ˆí„°ë§

### í™•ì¸ ëª…ë ¹ì–´
```cisco
# ì „ì²´ í¬íŠ¸ ë³´ì•ˆ ì •ë³´
Switch# show port-security

# íŠ¹ì • ì¸í„°í˜ì´ìŠ¤ ì •ë³´
Switch# show port-security interface fa0/1

# ë³´ì•ˆ MAC ì£¼ì†Œ í…Œì´ë¸”
Switch# show port-security address

# ìœ„ë°˜ ì •ë³´ í™•ì¸
Switch# show port-security interface fa0/1 address
```

### ì¶œë ¥ ì˜ˆì‹œ
```
Switch# show port-security interface fa0/1

Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 2
Total MAC Addresses        : 1
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 1
Last Source Address:Vlan   : 1111.2222.3333:1
Security Violation Count   : 0
```

### ì—ëŸ¬ ìƒíƒœ í™•ì¸
```cisco
# err-disabled ìƒíƒœ í™•ì¸
Switch# show interfaces status err-disabled

# err-disabled ì›ì¸ í™•ì¸
Switch# show errdisable recovery
```

## ğŸ”„ ì—ëŸ¬ ë³µêµ¬

### ìˆ˜ë™ ë³µêµ¬
```cisco
# í¬íŠ¸ ë‹¤ìš´ í›„ ë‹¤ì‹œ í™œì„±í™”
Switch(config)# interface fa0/1
Switch(config-if)# shutdown
Switch(config-if)# no shutdown
```

### ìë™ ë³µêµ¬ ì„¤ì •
```cisco
# err-disabled ìë™ ë³µêµ¬ í™œì„±í™”
Switch(config)# errdisable recovery cause psecure-violation

# ë³µêµ¬ ì‹œê°„ ì„¤ì • (ê¸°ë³¸: 300ì´ˆ)
Switch(config)# errdisable recovery interval 120
```

### MAC ì£¼ì†Œ ì‚­ì œ
```cisco
# íŠ¹ì • ë³´ì•ˆ MAC ì£¼ì†Œ ì‚­ì œ
Switch(config)# interface fa0/1
Switch(config-if)# no switchport port-security mac-address 1111.2222.3333

# ëª¨ë“  ë™ì  ë³´ì•ˆ MAC ì£¼ì†Œ ì‚­ì œ
Switch# clear port-security dynamic

# íŠ¹ì • ì¸í„°í˜ì´ìŠ¤ì˜ ë™ì  MAC ì‚­ì œ
Switch# clear port-security dynamic interface fa0/1

# Sticky MAC ì£¼ì†Œ ì‚­ì œ
Switch# clear port-security sticky interface fa0/1
```

## â° MAC ì£¼ì†Œ ì—ì´ì§•

### ì—ì´ì§• ì„¤ì •
```cisco
# ì—ì´ì§• ì‹œê°„ ì„¤ì • (ë¶„ ë‹¨ìœ„)
Switch(config-if)# switchport port-security aging time 60

# ì—ì´ì§• íƒ€ì… ì„¤ì •
Switch(config-if)# switchport port-security aging type absolute
# ë˜ëŠ”
Switch(config-if)# switchport port-security aging type inactivity

# ì •ì  MAC ì£¼ì†Œ ì—ì´ì§• í™œì„±í™”
Switch(config-if)# switchport port-security aging static
```

### ì—ì´ì§• íƒ€ì…
| íƒ€ì… | ì„¤ëª… |
|------|------|
| **Absolute** | ì„¤ì •ëœ ì‹œê°„ í›„ ë¬´ì¡°ê±´ ì‚­ì œ |
| **Inactivity** | ë¹„í™œì„± ì‹œê°„ í›„ ì‚­ì œ |

## ğŸš¨ ë¬¸ì œí•´ê²°

### ì¼ë°˜ì ì¸ ë¬¸ì œë“¤

#### 1. í¬íŠ¸ ë³´ì•ˆ í™œì„±í™” ì‹¤íŒ¨
```
ë¬¸ì œ: switchport port-security ëª…ë ¹ì–´ ì‹¤íŒ¨
ì›ì¸: íŠ¸ë í¬ ëª¨ë“œì—ì„œëŠ” í¬íŠ¸ ë³´ì•ˆ ë¶ˆê°€

í•´ê²°:
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
```

#### 2. MAC ì£¼ì†Œ í•™ìŠµ ì‹¤íŒ¨
```
ë¬¸ì œ: Sticky MACì´ í•™ìŠµë˜ì§€ ì•ŠìŒ
ì›ì¸: ì´ë¯¸ ìµœëŒ€ ê°œìˆ˜ì— ë„ë‹¬

í™•ì¸:
show port-security interface fa0/1

í•´ê²°:
- ìµœëŒ€ ê°œìˆ˜ ì¦ê°€ ë˜ëŠ”
- ê¸°ì¡´ MAC ì£¼ì†Œ ì‚­ì œ
```

#### 3. ì˜ˆìƒì¹˜ ëª»í•œ ìœ„ë°˜
```
ë¬¸ì œ: ì •ìƒ ì¥ì¹˜ì—ì„œ ìœ„ë°˜ ë°œìƒ
ì›ì¸: 
- VMì˜ MAC ì£¼ì†Œ ë³€ê²½
- NIC êµì²´
- ë©€í‹°í™ˆ ì¥ì¹˜

í•´ê²°:
- MAC ì£¼ì†Œ ì¬í™•ì¸
- Sticky ì„¤ì • ì¬êµ¬ì„±
```

### ë¬¸ì œí•´ê²° ë‹¨ê³„
```cisco
# 1. í˜„ì¬ ìƒíƒœ í™•ì¸
show port-security interface fa0/1

# 2. MAC ì£¼ì†Œ í…Œì´ë¸” í™•ì¸
show mac address-table interface fa0/1

# 3. ì¸í„°í˜ì´ìŠ¤ ìƒíƒœ í™•ì¸
show interfaces fa0/1 status

# 4. ì„¤ì • í™•ì¸
show running-config interface fa0/1

# 5. ë¡œê·¸ í™•ì¸
show logging | include PSECURE
```

## ğŸ¢ ì‹¤ë¬´ ì ìš© ì‹œë‚˜ë¦¬ì˜¤

### ì‚¬ë¬´ì‹¤ í™˜ê²½
```cisco
# ì¼ë°˜ ì‚¬ìš©ì í¬íŠ¸ (1ê°œ ì¥ì¹˜)
interface range fa0/1-20
 switchport mode access
 switchport access vlan 10
 switchport port-security
 switchport port-security maximum 1
 switchport port-security mac-address sticky
 switchport port-security violation shutdown
 spanning-tree portfast
```

### íšŒì˜ì‹¤/êµìœ¡ì‹¤
```cisco
# ë‹¤ì¤‘ ì¥ì¹˜ ì—°ê²° ê°€ëŠ¥ (ë…¸íŠ¸ë¶ + ì „í™”ê¸°)
interface range fa0/21-24
 switchport mode access
 switchport access vlan 20
 switchport port-security
 switchport port-security maximum 3
 switchport port-security violation restrict
 switchport port-security aging time 60
 switchport port-security aging type inactivity
```

### ì„œë²„ì‹¤/ì¤‘ìš” ì¥ë¹„
```cisco
# ê³ ì • MAC ì£¼ì†Œ ì„¤ì •
interface gi0/1
 switchport mode access
 switchport access vlan 100
 switchport port-security
 switchport port-security maximum 1
 switchport port-security mac-address 1111.2222.3333
 switchport port-security violation shutdown
```

## ğŸ›¡ï¸ ë³´ì•ˆ ëª¨ë²” ì‚¬ë¡€

### ì„¤ì • ê¶Œì¥ì‚¬í•­
```
1. ì•¡ì„¸ìŠ¤ í¬íŠ¸ì—ì„œë§Œ ì‚¬ìš©
2. í•„ìš”í•œ ìµœì†Œ MAC ê°œìˆ˜ë¡œ ì œí•œ
3. Sticky í•™ìŠµ í™œìš©
4. ì ì ˆí•œ ìœ„ë°˜ ëª¨ë“œ ì„ íƒ
5. ì—ì´ì§• ì •ì±… ì„¤ì •
6. ìë™ ë³µêµ¬ ì„¤ì • ê³ ë ¤
```

### ë³´ì•ˆ ê°•í™” ë°©ë²•
```cisco
# 1. ë¯¸ì‚¬ìš© í¬íŠ¸ ë¹„í™œì„±í™”
interface range fa0/11-24
 shutdown
 switchport mode access
 switchport access vlan 999

# 2. Native VLAN ë³€ê²½
vlan 999
 name UNUSED
interface fa0/24
 switchport trunk native vlan 999

# 3. í¬íŠ¸ ë³´ì•ˆê³¼ 802.1X ì—°ë™
interface fa0/1
 switchport mode access
 switchport port-security
 authentication host-mode multi-domain
 authentication port-control auto
```

## ğŸ“‹ ì²´í¬ë¦¬ìŠ¤íŠ¸

### ì„¤ì • ì „ ì ê²€ì‚¬í•­
- [ ] ì¸í„°í˜ì´ìŠ¤ê°€ ì•¡ì„¸ìŠ¤ ëª¨ë“œì¸ê°€?
- [ ] ì—°ê²°ë  ì¥ì¹˜ ìˆ˜ëŠ” ëª‡ ê°œì¸ê°€?
- [ ] ê³ ì • MAC ì£¼ì†Œê°€ í•„ìš”í•œê°€?
- [ ] ìœ„ë°˜ ì‹œ ì–´ë–»ê²Œ ì²˜ë¦¬í•  ê²ƒì¸ê°€?
- [ ] ìë™ ë³µêµ¬ê°€ í•„ìš”í•œê°€?

### ì„¤ì • í›„ í™•ì¸ì‚¬í•­
- [ ] í¬íŠ¸ ë³´ì•ˆì´ í™œì„±í™”ë˜ì—ˆëŠ”ê°€?
- [ ] MAC ì£¼ì†Œê°€ ì˜¬ë°”ë¥´ê²Œ í•™ìŠµë˜ì—ˆëŠ”ê°€?
- [ ] ìœ„ë°˜ í…ŒìŠ¤íŠ¸ë¥¼ ìˆ˜í–‰í–ˆëŠ”ê°€?
- [ ] ë³µêµ¬ ì ˆì°¨ë¥¼ ë¬¸ì„œí™”í–ˆëŠ”ê°€?

## ğŸ”— ê´€ë ¨ ì£¼ì œ
- [[ìŠ¤ìœ„ì¹˜ ë™ì‘ì›ë¦¬|ìŠ¤ìœ„ì¹­]] - MAC ì£¼ì†Œ í•™ìŠµ ì›ë¦¬
- [[VLAN êµ¬ì„±|VLAN]] - ì•¡ì„¸ìŠ¤ í¬íŠ¸ì™€ VLAN
- [[ë„¤íŠ¸ì›Œí¬ ë³´ì•ˆ|ë³´ì•ˆ]] - ì „ì²´ì ì¸ ë³´ì•ˆ ì „ëµ
- [[802.1X ì¸ì¦|ì¸ì¦]] - í¬íŠ¸ ê¸°ë°˜ ë„¤íŠ¸ì›Œí¬ ì ‘ê·¼ ì œì–´

## ğŸ·ï¸ íƒœê·¸
#ccna #í¬íŠ¸ë³´ì•ˆ #ìŠ¤ìœ„ì¹˜ë³´ì•ˆ #macì£¼ì†Œ #ë„¤íŠ¸ì›Œí¬ë³´ì•ˆ #ì ‘ê·¼ì œì–´ #ìŠ¤ìœ„ì¹­