# ACL (Access Control Lists) - ìƒì„¸ ê°€ì´ë“œ

## ğŸ“ ê°œìš”
ACL(Access Control Lists)ì€ ë„¤íŠ¸ì›Œí¬ì—ì„œ íŠ¸ë˜í”½ì„ ì œì–´í•˜ëŠ” ê·œì¹™ì˜ ìˆœì„œí™”ëœ ì§‘í•©ì…ë‹ˆë‹¤. ë¼ìš°í„°ì™€ ìŠ¤ìœ„ì¹˜ì—ì„œ íŒ¨í‚·ì„ í—ˆìš©í•˜ê±°ë‚˜ ê±°ë¶€í•˜ëŠ” ë³´ì•ˆ ë©”ì»¤ë‹ˆì¦˜ì˜ í•µì‹¬ì…ë‹ˆë‹¤.

## ğŸ¯ ACLì˜ ëª©ì ê³¼ ìš©ë„

### ë³´ì•ˆ ê¸°ëŠ¥
- **ì•¡ì„¸ìŠ¤ ì œì–´**: íŠ¹ì • ì‚¬ìš©ì/ë„¤íŠ¸ì›Œí¬ì˜ ì ‘ê·¼ ì°¨ë‹¨
- **ê³µê²© ë°©ì–´**: DDoS, ìŠ¤í‘¸í•‘ ë“± ê³µê²© ì°¨ë‹¨
- **ë‚´ë¶€ ë³´ì•ˆ**: ë‚´ë¶€ ë„¤íŠ¸ì›Œí¬ ê°„ íŠ¸ë˜í”½ ì œì–´
- **ê°ì‚¬ ì¶”ì **: íŠ¸ë˜í”½ ë¡œê¹… ë° ëª¨ë‹ˆí„°ë§

### ê´€ë¦¬ ê¸°ëŠ¥
- **ëŒ€ì—­í­ ê´€ë¦¬**: íŠ¹ì • íŠ¸ë˜í”½ ì œí•œ
- **QoS ë¶„ë¥˜**: íŠ¸ë˜í”½ ìš°ì„ ìˆœìœ„ ê²°ì •
- **NAT ì •ì˜**: ì£¼ì†Œ ë³€í™˜ ë²”ìœ„ ì§€ì •
- **VPN íŠ¸ë˜í”½**: ì•”í˜¸í™”í•  íŠ¸ë˜í”½ ì •ì˜

## ğŸ”§ ACL ë™ì‘ ì›ë¦¬

### ê¸°ë³¸ ì›ì¹™
```
1. Top-down Processing: ìœ„ì—ì„œë¶€í„° ìˆœì°¨ì  ê²€ì‚¬
2. First Match Principle: ì²« ë²ˆì§¸ ì¼ì¹˜ ì‹œ ì ìš©
3. Implicit Deny All: ë§ˆì§€ë§‰ì— ì•”ë¬µì  "deny any" ì¡´ì¬
4. Return Traffic: ìƒíƒœ ì¶”ì  ì—†ìŒ (ë³„ë„ ì„¤ì • í•„ìš”)
```

### ì²˜ë¦¬ íë¦„
```mermaid
flowchart TD
    A[íŒ¨í‚· ë„ì°©] --> B[ì²« ë²ˆì§¸ ACE ê²€ì‚¬]
    B --> C{ì¼ì¹˜?}
    C -->|Yes| D[Action ìˆ˜í–‰]
    C -->|No| E[ë‹¤ìŒ ACE ê²€ì‚¬]
    E --> F{ë” ìˆë‚˜?}
    F -->|Yes| C
    F -->|No| G[Implicit Deny]
    D --> H[ë¡œê·¸ ìƒì„±]
    G --> H
    H --> I[íŒ¨í‚· ì²˜ë¦¬ ì™„ë£Œ]
```

## ğŸ­ ì™€ì¼ë“œì¹´ë“œ ë§ˆìŠ¤í¬ (Wildcard Mask)

### ê°œë…ê³¼ íŠ¹ì§•
```
ì„œë¸Œë„· ë§ˆìŠ¤í¬ì™€ ì •ë°˜ëŒ€:
- 0 ë¹„íŠ¸: ë°˜ë“œì‹œ ì¼ì¹˜í•´ì•¼ í•¨ (care bit)
- 1 ë¹„íŠ¸: ë¬´ì‹œí•¨ (don't care bit)

ê³„ì‚°ë²•: ì™€ì¼ë“œì¹´ë“œ = 255.255.255.255 - ì„œë¸Œë„·ë§ˆìŠ¤í¬
```

### ì£¼ìš” ì™€ì¼ë“œì¹´ë“œ íŒ¨í„´
| ëª©ì  | ì£¼ì†Œ/ì™€ì¼ë“œì¹´ë“œ | ì˜ë¯¸ |
|------|----------------|------|
| **íŠ¹ì • í˜¸ìŠ¤íŠ¸** | 192.168.1.10 0.0.0.0 | host 192.168.1.10 |
| **ì „ì²´ ë„¤íŠ¸ì›Œí¬ /24** | 192.168.1.0 0.0.0.255 | 192.168.1.0/24 |
| **ì „ì²´ ë„¤íŠ¸ì›Œí¬ /16** | 192.168.0.0 0.0.255.255 | 192.168.0.0/16 |
| **ëª¨ë“  ì£¼ì†Œ** | 0.0.0.0 255.255.255.255 | any |
| **í™€ìˆ˜ í˜¸ìŠ¤íŠ¸** | 192.168.1.1 0.0.0.254 | ë§ˆì§€ë§‰ ì˜¥í…Ÿ í™€ìˆ˜ |
| **ì§ìˆ˜ í˜¸ìŠ¤íŠ¸** | 192.168.1.0 0.0.0.254 | ë§ˆì§€ë§‰ ì˜¥í…Ÿ ì§ìˆ˜ |

### ê³„ì‚° ì˜ˆì‹œ
```
ë„¤íŠ¸ì›Œí¬: 192.168.10.0/26
ì„œë¸Œë„· ë§ˆìŠ¤í¬: 255.255.255.192
ì™€ì¼ë“œì¹´ë“œ: 255.255.255.255 - 255.255.255.192 = 0.0.0.63

ê²°ê³¼: 192.168.10.0 0.0.0.63
ì˜ë¯¸: 192.168.10.0 ~ 192.168.10.63 ë²”ìœ„
```

## ğŸ“‹ Standard ACL

### íŠ¹ì§• ìš”ì•½
- **ë²ˆí˜¸ ë²”ìœ„**: 1-99, 1300-1999
- **ê²€ì‚¬ í•­ëª©**: ì¶œë°œì§€ IP ì£¼ì†Œë§Œ
- **ë°°ì¹˜ ìœ„ì¹˜**: ëª©ì ì§€ì— ìµœëŒ€í•œ ê°€ê¹Œì´
- **ì²˜ë¦¬ ì˜¤ë²„í—¤ë“œ**: ë‚®ìŒ

### ì„¤ì • ë°©ë²•
```cisco
# ê¸°ë³¸ ë¬¸ë²•
Router(config)# access-list number {permit|deny} source [wildcard]

# êµ¬ì²´ì  ì˜ˆì‹œ
Router(config)# access-list 10 permit 192.168.1.0 0.0.0.255
Router(config)# access-list 10 deny 192.168.2.10 0.0.0.0
Router(config)# access-list 10 permit any

# ì¶•ì•½ í‘œí˜„
Router(config)# access-list 10 permit host 192.168.1.10
Router(config)# access-list 10 deny any
```

### ì¸í„°í˜ì´ìŠ¤ ì ìš©
```cisco
# ì¸ë°”ìš´ë“œ ì ìš©
Router(config)# interface fastethernet 0/0
Router(config-if)# ip access-group 10 in

# ì•„ì›ƒë°”ìš´ë“œ ì ìš©  
Router(config-if)# ip access-group 10 out
```

## ğŸ“Š Extended ACL

### íŠ¹ì§• ìš”ì•½
- **ë²ˆí˜¸ ë²”ìœ„**: 100-199, 2000-2699
- **ê²€ì‚¬ í•­ëª©**: ì¶œë°œì§€, ëª©ì ì§€, í”„ë¡œí† ì½œ, í¬íŠ¸
- **ë°°ì¹˜ ìœ„ì¹˜**: ì¶œë°œì§€ì— ìµœëŒ€í•œ ê°€ê¹Œì´
- **ì²˜ë¦¬ ì˜¤ë²„í—¤ë“œ**: ë†’ìŒ (ë” ì •ë°€í•œ ì œì–´)

### ê¸°ë³¸ ë¬¸ë²•
```cisco
access-list number {permit|deny} protocol source source-wildcard 
         destination destination-wildcard [operator port]
```

### í”„ë¡œí† ì½œ ì§€ì •
```cisco
# IP ì „ì²´
access-list 100 permit ip any any

# TCP í”„ë¡œí† ì½œ
access-list 100 permit tcp 192.168.1.0 0.0.0.255 any eq 80

# UDP í”„ë¡œí† ì½œ  
access-list 100 permit udp any host 192.168.2.10 eq 53

# ICMP í”„ë¡œí† ì½œ
access-list 100 permit icmp any any echo-reply
```

### í¬íŠ¸ ì—°ì‚°ì
| ì—°ì‚°ì | ì˜ë¯¸ | ì˜ˆì‹œ |
|--------|------|------|
| **eq** | ê°™ìŒ | eq 80 (í¬íŠ¸ 80) |
| **neq** | ê°™ì§€ ì•ŠìŒ | neq 23 (í…”ë„· ì œì™¸) |
| **lt** | ë¯¸ë§Œ | lt 1024 (well-known í¬íŠ¸) |
| **gt** | ì´ˆê³¼ | gt 1023 (ë“±ë¡ëœ í¬íŠ¸) |
| **range** | ë²”ìœ„ | range 20 21 (FTP) |

### ì‹¤ë¬´ ì˜ˆì‹œ
```cisco
# ì›¹ ì„œë²„ ë³´í˜¸ ACL
Router(config)# access-list 120 permit tcp any host 192.168.1.100 eq 80
Router(config)# access-list 120 permit tcp any host 192.168.1.100 eq 443
Router(config)# access-list 120 permit tcp any host 192.168.1.100 eq 22
Router(config)# access-list 120 deny tcp any host 192.168.1.100
Router(config)# access-list 120 permit ip any any

# ê´€ë¦¬ ë„¤íŠ¸ì›Œí¬ë§Œ SSH í—ˆìš©
Router(config)# access-list 130 permit tcp 10.0.0.0 0.0.0.255 any eq 22
Router(config)# access-list 130 deny tcp any any eq 22
Router(config)# access-list 130 permit ip any any
```

## ğŸ·ï¸ Named ACL

### ì¥ì 
- **ì˜ë¯¸ ìˆëŠ” ì´ë¦„**: ê¸°ëŠ¥ë³„ êµ¬ë¶„ ì‰¬ì›€
- **ìœ ì—°í•œ í¸ì§‘**: ë¼ì¸ ë²ˆí˜¸ë¡œ ê°œë³„ ìˆ˜ì •
- **ìˆœì„œ ì œì–´**: ì›í•˜ëŠ” ìœ„ì¹˜ì— ì‚½ì…
- **ê°€ë…ì„± í–¥ìƒ**: ìœ ì§€ë³´ìˆ˜ ìš©ì´

### Standard Named ACL
```cisco
# ìƒì„±
Router(config)# ip access-list standard BRANCH_OFFICE
Router(config-std-nacl)# permit 192.168.10.0 0.0.0.255
Router(config-std-nacl)# permit 192.168.20.0 0.0.0.255
Router(config-std-nacl)# deny any

# ì ìš©
Router(config)# interface serial 0/0/0
Router(config-if)# ip access-group BRANCH_OFFICE out
```

### Extended Named ACL
```cisco
# ìƒì„±
Router(config)# ip access-list extended INTERNET_ACCESS
Router(config-ext-nacl)# 10 permit tcp 192.168.1.0 0.0.0.255 any eq 80
Router(config-ext-nacl)# 20 permit tcp 192.168.1.0 0.0.0.255 any eq 443
Router(config-ext-nacl)# 30 permit udp 192.168.1.0 0.0.0.255 any eq 53
Router(config-ext-nacl)# 40 deny tcp any any eq 23
Router(config-ext-nacl)# 50 permit icmp any any
Router(config-ext-nacl)# 60 deny ip any any log

# ë¼ì¸ í¸ì§‘
Router(config)# ip access-list extended INTERNET_ACCESS
Router(config-ext-nacl)# 25 permit tcp 192.168.1.0 0.0.0.255 any eq 25
Router(config-ext-nacl)# no 40  # ë¼ì¸ 40 ì‚­ì œ
```

## ğŸ“ ACL ë°°ì¹˜ ì›ì¹™

### Standard ACL ë°°ì¹˜
```
ì›ì¹™: ëª©ì ì§€ì— ê°€ê¹Œì´ ë°°ì¹˜

ì´ìœ :
- ì¶œë°œì§€ë§Œ ê²€ì‚¬í•˜ë¯€ë¡œ ë„ˆë¬´ ì¼ì° ì°¨ë‹¨í•˜ë©´ 
  ë‹¤ë¥¸ ëª©ì ì§€ë¡œì˜ ì •ìƒ íŠ¸ë˜í”½ë„ ì°¨ë‹¨ë  ìˆ˜ ìˆìŒ

     [PC1]â”€â”€â”€[R1]â”€â”€â”€[R2]â”€â”€â”€[Server]
                      â†‘
                  ì—¬ê¸°ì— ì ìš© (ëª©ì ì§€ ê·¼ì²˜)
```

### Extended ACL ë°°ì¹˜
```
ì›ì¹™: ì¶œë°œì§€ì— ê°€ê¹Œì´ ë°°ì¹˜

ì´ìœ :
- ì •ë°€í•œ ì œì–´ê°€ ê°€ëŠ¥í•˜ë¯€ë¡œ ë¶ˆí•„ìš”í•œ íŠ¸ë˜í”½ì„
  ì¡°ê¸°ì— ì°¨ë‹¨í•˜ì—¬ ëŒ€ì—­í­ ì ˆì•½

[PC1]â”€â”€â”€[R1]â”€â”€â”€[R2]â”€â”€â”€[Server]
         â†‘
    ì—¬ê¸°ì— ì ìš© (ì¶œë°œì§€ ê·¼ì²˜)
```

## ğŸ” ACL í™•ì¸ ë° ëª¨ë‹ˆí„°ë§

### ê¸°ë³¸ í™•ì¸ ëª…ë ¹ì–´
```cisco
# ëª¨ë“  ACL ë³´ê¸°
Router# show access-lists

# íŠ¹ì • ACL ë³´ê¸°
Router# show access-list 100
Router# show access-list INTERNET_ACCESS

# ì¸í„°í˜ì´ìŠ¤ ì ìš© ìƒíƒœ
Router# show ip interface fastethernet 0/0

# ACL í†µê³„ (íˆíŠ¸ ì¹´ìš´íŠ¸)
Router# show access-lists 100
```

### ì¶œë ¥ ì˜ˆì‹œ í•´ì„
```
Router# show access-list 100
Extended IP access list 100
    10 permit tcp 192.168.1.0 0.0.0.255 any eq www (15 matches)
    20 permit tcp 192.168.1.0 0.0.0.255 any eq 443 (8 matches)  
    30 deny tcp any any eq telnet (2 matches)
    40 permit ip any any (1453 matches)
```

## ğŸ› ë¬¸ì œí•´ê²° ë° ë””ë²„ê¹…

### ì¼ë°˜ì ì¸ ë¬¸ì œë“¤

#### 1. ì˜ë„ì¹˜ ì•Šì€ íŠ¸ë˜í”½ ì°¨ë‹¨
```
ë¬¸ì œ: ì •ìƒ íŠ¸ë˜í”½ì´ ì°¨ë‹¨ë¨
ì›ì¸: 
- ì˜ëª»ëœ ACL ìˆœì„œ
- ì™€ì¼ë“œì¹´ë“œ ë§ˆìŠ¤í¬ ì˜¤ë¥˜
- implicit deny

í•´ê²°:
1. ACL ìˆœì„œ ì ê²€
2. ë¡œê·¸ í™•ì¸
3. í…ŒìŠ¤íŠ¸ìš© permit any ì„ì‹œ ì¶”ê°€
```

#### 2. ë¦¬í„´ íŠ¸ë˜í”½ ë¬¸ì œ
```
ë¬¸ì œ: ì‘ë‹µ íŒ¨í‚·ì´ ëŒì•„ì˜¤ì§€ ì•ŠìŒ
ì›ì¸: ACLì´ ë‹¨ë°©í–¥ì„±ì´ë¯€ë¡œ ë¦¬í„´ íŠ¸ë˜í”½ ê³ ë ¤ ì•ˆí•¨

í•´ê²°:
1. ì–‘ë°©í–¥ ACL ì„¤ì •
2. Established ì—°ê²° í—ˆìš©
3. ìƒíƒœ ì¶”ì  ê¸°ëŠ¥ ì‚¬ìš© ê³ ë ¤
```

#### 3. ì„±ëŠ¥ ì €í•˜
```
ë¬¸ì œ: ACL ì ìš© í›„ ì„±ëŠ¥ ì €í•˜
ì›ì¸: 
- ë³µì¡í•œ Extended ACL
- ë„ˆë¬´ ë§ì€ ACE
- ë¹„íš¨ìœ¨ì ì¸ ìˆœì„œ

í•´ê²°:
1. ìì£¼ ë§¤ì¹˜ë˜ëŠ” ê·œì¹™ì„ ìœ„ìª½ì— ë°°ì¹˜
2. ë¶ˆí•„ìš”í•œ ê·œì¹™ ì œê±°
3. í•˜ë“œì›¨ì–´ ê°€ì† ê¸°ëŠ¥ í™œìš©
```

### ë””ë²„ê¹… ëª…ë ¹ì–´
```cisco
# ACL ë¡œê¹… í™œì„±í™”
Router(config)# access-list 100 deny ip any any log

# ìƒì„¸ ë¡œê¹…
Router(config)# access-list 100 deny ip any any log-input

# ë¡œê·¸ í™•ì¸
Router# show logging

# ì‹¤ì‹œê°„ ë¡œê·¸ ëª¨ë‹ˆí„°ë§
Router# terminal monitor
Router# debug ip packet 100  # ACL 100ì— ëŒ€í•´ì„œë§Œ
```

## ğŸš€ ê³ ê¸‰ ACL ê¸°ëŠ¥

### Time-based ACL
```cisco
# ì‹œê°„ ë²”ìœ„ ì •ì˜
Router(config)# time-range BUSINESS_HOURS
Router(config-time-range)# periodic weekdays 09:00 to 18:00

# ACLì— ì ìš©
Router(config)# ip access-list extended TIME_POLICY
Router(config-ext-nacl)# permit tcp any any eq 80 time-range BUSINESS_HOURS
Router(config-ext-nacl)# deny tcp any any eq 80
```

### Reflexive ACL (ìƒíƒœ ì¶”ì )
```cisco
# ë‚´ë¶€ì—ì„œ ì™¸ë¶€ë¡œì˜ íŠ¸ë˜í”½ í—ˆìš©
Router(config)# ip access-list extended OUTBOUND
Router(config-ext-nacl)# permit tcp 192.168.1.0 0.0.0.255 any reflect TCP_TRAFFIC

# ì™¸ë¶€ì—ì„œ ë‚´ë¶€ë¡œëŠ” ì„¤ì •ëœ ì„¸ì…˜ë§Œ í—ˆìš©
Router(config)# ip access-list extended INBOUND  
Router(config-ext-nacl)# evaluate TCP_TRAFFIC
Router(config-ext-nacl)# deny ip any any

# ì¸í„°í˜ì´ìŠ¤ ì ìš©
Router(config)# interface fastethernet 0/0
Router(config-if)# ip access-group OUTBOUND out
Router(config-if)# ip access-group INBOUND in
```

### Dynamic ACL (Lock-and-Key)
```cisco
# ë™ì  ACL í…œí”Œë¦¿
Router(config)# access-list 101 dynamic TEMP_ACCESS timeout 10 permit ip any any

# ì‚¬ìš©ì ì¸ì¦ í›„ ë™ì  ACL í™œì„±í™”
Router(config)# username admin password secret123
Router(config)# line vty 0 4
Router(config-line)# login local
Router(config-line)# autocommand access-enable host timeout 5
```

## ğŸ›¡ï¸ ë³´ì•ˆ ëª¨ë²” ì‚¬ë¡€

### ACL ì„¤ê³„ ì›ì¹™
```
1. Principle of Least Privilege
   - í•„ìš”í•œ ìµœì†Œí•œì˜ ê¶Œí•œë§Œ ë¶€ì—¬
   - ê¸°ë³¸ì ìœ¼ë¡œ ëª¨ë“  ê²ƒì„ ì°¨ë‹¨í•˜ê³  í•„ìš”í•œ ê²ƒë§Œ í—ˆìš©

2. Defense in Depth
   - ë‹¤ê³„ì¸µ ë³´ì•ˆ ì ìš©
   - ë°©í™”ë²½ + ACL + ê¸°íƒ€ ë³´ì•ˆ ê¸°ëŠ¥ ì¡°í•©

3. Regular Review
   - ì •ê¸°ì ì¸ ACL ê²€í†  ë° ì—…ë°ì´íŠ¸
   - ë¶ˆí•„ìš”í•œ ê·œì¹™ ì œê±°
   - ë¡œê·¸ ë¶„ì„ì„ í†µí•œ ìµœì í™”
```

### ì‹¤ë¬´ ì²´í¬ë¦¬ìŠ¤íŠ¸
```
ì„¤ì • ì „:
â–¡ íŠ¸ë˜í”½ í”Œë¡œìš° ë¶„ì„ ì™„ë£Œ
â–¡ í•„ìš”í•œ ì„œë¹„ìŠ¤/í¬íŠ¸ ëª©ë¡ ì‘ì„±
â–¡ ë°°ì¹˜ ìœ„ì¹˜ ê²°ì •
â–¡ í…ŒìŠ¤íŠ¸ ê³„íš ìˆ˜ë¦½

ì„¤ì • í›„:
â–¡ ì •ìƒ íŠ¸ë˜í”½ í…ŒìŠ¤íŠ¸
â–¡ ì°¨ë‹¨ íŠ¸ë˜í”½ í…ŒìŠ¤íŠ¸  
â–¡ ë¡œê·¸ ëª¨ë‹ˆí„°ë§ ì„¤ì •
â–¡ ë¬¸ì„œí™” ì™„ë£Œ
â–¡ ë°±ì—… ë° ë³µêµ¬ ê³„íš
```

## ğŸ“š ì‹¤ë¬´ ì‹œë‚˜ë¦¬ì˜¤

### ì‹œë‚˜ë¦¬ì˜¤ 1: ì§€ì‚¬ ì‚¬ë¬´ì‹¤ ë³´ì•ˆ
```
ìš”êµ¬ì‚¬í•­:
- ë‚´ë¶€ ì‚¬ìš©ìëŠ” ì¸í„°ë„· ì ‘ê·¼ í—ˆìš© (HTTP/HTTPSë§Œ)
- ì™¸ë¶€ì—ì„œ ë‚´ë¶€ ë„¤íŠ¸ì›Œí¬ ì ‘ê·¼ ì°¨ë‹¨
- ê´€ë¦¬ìë§Œ SSH ì ‘ê·¼ í—ˆìš©

ì„¤ì •:
Router(config)# ip access-list extended BRANCH_SECURITY
Router(config-ext-nacl)# permit tcp 192.168.1.0 0.0.0.255 any eq 80
Router(config-ext-nacl)# permit tcp 192.168.1.0 0.0.0.255 any eq 443
Router(config-ext-nacl)# permit tcp host 10.0.0.100 192.168.1.0 0.0.0.255 eq 22
Router(config-ext-nacl)# permit udp 192.168.1.0 0.0.0.255 any eq 53
Router(config-ext-nacl)# deny ip any 192.168.1.0 0.0.0.255
Router(config-ext-nacl)# permit ip any any
```

### ì‹œë‚˜ë¦¬ì˜¤ 2: DMZ ì„œë²„ ë³´í˜¸
```
ìš”êµ¬ì‚¬í•­:
- ì›¹ ì„œë²„ëŠ” HTTP/HTTPSë§Œ í—ˆìš©
- ë©”ì¼ ì„œë²„ëŠ” SMTP/POP3/IMAP í—ˆìš©
- ë‚´ë¶€ì—ì„œë§Œ SSH ê´€ë¦¬ í—ˆìš©

ì„¤ì •:
Router(config)# ip access-list extended DMZ_PROTECTION
Router(config-ext-nacl)# permit tcp any host 203.0.113.10 eq 80
Router(config-ext-nacl)# permit tcp any host 203.0.113.10 eq 443
Router(config-ext-nacl)# permit tcp any host 203.0.113.20 eq 25
Router(config-ext-nacl)# permit tcp any host 203.0.113.20 eq 110
Router(config-ext-nacl)# permit tcp any host 203.0.113.20 eq 143
Router(config-ext-nacl)# permit tcp 192.168.0.0 0.0.255.255 203.0.113.0 0.0.0.255 eq 22
Router(config-ext-nacl)# deny ip any 203.0.113.0 0.0.0.255
```

## ğŸ”— ê´€ë ¨ ì£¼ì œ
- [[NAT-PAT|NAT/PAT]] - ACLê³¼ ì£¼ì†Œ ë³€í™˜
- [[í¬íŠ¸ ë³´ì•ˆ|í¬íŠ¸ ë³´ì•ˆ]] - Layer 2 ë³´ì•ˆ
- [[ë°©í™”ë²½|ë°©í™”ë²½]] - ìƒíƒœ ì¶”ì  ë³´ì•ˆ
- [[ë¼ìš°íŒ… ê¸°ì´ˆ|ë¼ìš°íŒ…]] - íŒ¨í‚· í¬ì›Œë”©ê³¼ ACL

## ğŸ·ï¸ íƒœê·¸
#ccna #acl #ë„¤íŠ¸ì›Œí¬ë³´ì•ˆ #íŠ¸ë˜í”½ì œì–´ #ì ‘ê·¼ì œì–´ #ë³´ì•ˆì •ì±… #íŒ¨í‚·í•„í„°ë§