# 포트 보안 (Port Security)

## 개요
포트 보안은 [[스위치 동작원리]]를 기반으로 하여 스위치 포트에 연결할 수 있는 디바이스를 제한하는 보안 기능입니다. MAC 주소를 이용해 인가되지 않은 장비의 접근을 차단하여 네트워크 보안을 강화합니다.

## 포트 보안의 필요성

### 보안 위협
```
MAC 플러딩 공격:
- 가짜 MAC 주소로 스위치 테이블 오버플로우
- 스위치가 허브처럼 동작하게 됨
- 모든 트래픽이 플러딩되어 도청 가능

무단 장비 연결:
- 허가받지 않은 PC, 랩톱 연결
- 내부 네트워크 무단 접근
- 데이터 유출 위험

네트워크 혼잡:
- 과도한 트래픽 생성 장비
- 브로드캐스트 스톰 유발
- 네트워크 성능 저하
```

### 포트 보안 해결책
```
✅ MAC 주소 기반 접근 제어
✅ 포트별 연결 장비 수 제한
✅ 동적/정적 MAC 주소 학습
✅ 위반 시 자동 대응
✅ 로깅 및 모니터링
```

## 포트 보안 기본 개념

### MAC 주소 학습 방식
```
1. Dynamic (동적):
   - 자동으로 MAC 주소 학습
   - 스위치 재부팅 시 삭제
   - 가장 일반적인 방식

2. Static (정적):
   - 수동으로 MAC 주소 지정
   - 재부팅 후에도 유지
   - 높은 보안 수준

3. Sticky (고정):
   - 동적 학습 후 자동으로 고정
   - 설정에 자동 추가
   - 편의성과 보안성 균형
```

### 보안 위반 유형
```
위반 조건:
- 허용된 최대 MAC 주소 수 초과
- 허용되지 않은 MAC 주소 감지
- 다른 포트의 보안 MAC 주소 감지

위반 감지 시점:
- 새로운 프레임 수신 시
- MAC 주소 테이블 학습 시
- 이미 다른 포트에 학습된 MAC 감지 시
```

## 위반 모드 (Violation Modes)

### Protect 모드
```
동작:
- 위반 프레임 드롭
- 로그 메시지 없음
- 포트 상태 유지
- SNMP 트랩 없음

특징:
✅ 서비스 중단 없음
❌ 위반 감지 어려움
❌ 보안 사고 추적 곤란

사용 용도: 서비스 연속성이 중요한 환경
```

### Restrict 모드
```
동작:
- 위반 프레임 드롭
- 로그 메시지 생성
- 포트 상태 유지
- SNMP 트랩 전송
- 위반 카운터 증가

특징:
✅ 서비스 중단 없음
✅ 위반 사실 기록
✅ 모니터링 가능

사용 용도: 모니터링이 중요한 환경
```

### Shutdown 모드 (기본값)
```
동작:
- 위반 시 포트 err-disabled 상태로 변경
- 로그 메시지 생성
- SNMP 트랩 전송
- 수동 복구 필요

특징:
✅ 강력한 보안
✅ 명확한 위반 표시
❌ 서비스 중단
❌ 수동 개입 필요

사용 용도: 높은 보안이 필요한 환경
```

## 포트 보안 설정

### 기본 설정
```cisco
# 포트를 액세스 모드로 설정 (필수)
Switch(config)# interface fastethernet 0/1
Switch(config-if)# switchport mode access

# 포트 보안 활성화
Switch(config-if)# switchport port-security

# 최대 MAC 주소 수 설정 (기본값: 1)
Switch(config-if)# switchport port-security maximum 2

# 위반 모드 설정 (기본값: shutdown)
Switch(config-if)# switchport port-security violation restrict
```

### 정적 MAC 주소 설정
```cisco
# 특정 MAC 주소 허용
Switch(config-if)# switchport port-security mac-address 0012.3456.789a
Switch(config-if)# switchport port-security mac-address 0012.3456.789b

# 여러 MAC 주소 동시 설정
Switch(config)# interface fastethernet 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 3
Switch(config-if)# switchport port-security mac-address 1111.2222.3333
Switch(config-if)# switchport port-security mac-address 4444.5555.6666
```

### Sticky MAC 주소 설정
```cisco
# Sticky 학습 활성화
Switch(config)# interface fastethernet 0/3
Switch(config-if)# switchport mode access
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security violation restrict

# 자동으로 설정에 추가됨
Switch(config-if)# switchport port-security mac-address sticky 0012.3456.789c
```

### 고급 설정
```cisco
# 에이징 설정 (동적 MAC 주소만 적용)
Switch(config-if)# switchport port-security aging time 60
Switch(config-if)# switchport port-security aging type inactivity

# 에이징 유형:
# absolute: 절대 시간 (학습 후 지정 시간)
# inactivity: 비활성 시간 (마지막 사용 후 지정 시간)

# 정적 MAC 주소 에이징 포함
Switch(config-if)# switchport port-security aging static
```

## 포트 보안 확인

### 기본 확인 명령어
```cisco
# 전체 포트 보안 상태
Switch# show port-security

# 특정 인터페이스 상세 정보
Switch# show port-security interface fastethernet 0/1

# 보안 MAC 주소 테이블
Switch# show port-security address

# 위반 통계
Switch# show port-security violation
```

### 출력 예시 해석
```
Switch# show port-security
Secure Port  MaxSecureAddr  CurrentAddr  SecurityViolation  Security Action
                (Count)       (Count)          (Count)
---------------------------------------------------------------------------
    Fa0/1           2             1                0           Restrict
    Fa0/2           1             1                0           Shutdown
    Fa0/3           3             2                1           Protect
---------------------------------------------------------------------------
Total Addresses in System (excluding one mac per port)     : 3
Max Addresses limit in System (excluding one mac per port) : 8192

해석:
- Fa0/1: 최대 2개, 현재 1개, 위반 0회, Restrict 모드
- Fa0/2: 최대 1개, 현재 1개, 위반 0회, Shutdown 모드  
- Fa0/3: 최대 3개, 현재 2개, 위반 1회, Protect 모드
```

### 상세 인터페이스 정보
```
Switch# show port-security interface fastethernet 0/1
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Restrict
Aging Time                 : 60 mins
Aging Type                 : Inactivity
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 2
Total MAC Addresses        : 1
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 1
Last Source Address:Vlan   : 0012.3456.789a:1
Security Violation Count   : 0

포트 상태 의미:
- Secure-up: 보안 활성화, 포트 up
- Secure-down: 보안 활성화, 포트 down
- Secure-shutdown: 보안 위반으로 차단됨
```

## 에러 복구

### err-disabled 상태 복구
```cisco
# 수동 복구
Switch(config)# interface fastethernet 0/1
Switch(config-if)# shutdown
Switch(config-if)# no shutdown

# 자동 복구 설정
Switch(config)# errdisable recovery cause psecure-violation
Switch(config)# errdisable recovery interval 600

# 복구 설정 확인
Switch# show errdisable recovery
ErrDisable Reason            Timer Status
-----------------            ------------
psecure-violation            Enabled
Timer interval: 600 seconds
```

### 보안 MAC 주소 삭제
```cisco
# 특정 MAC 주소 삭제
Switch(config-if)# no switchport port-security mac-address 0012.3456.789a

# 모든 동적 MAC 주소 삭제
Switch# clear port-security dynamic

# 특정 인터페이스의 동적 MAC 삭제
Switch# clear port-security dynamic interface fastethernet 0/1

# 특정 MAC 주소만 삭제
Switch# clear port-security dynamic address 0012.3456.789a
```

## 포트 보안 문제해결

### 일반적인 문제
```
1. 포트 보안 활성화 실패
   원인: 트렁크 모드에서는 포트 보안 사용 불가
   해결: switchport mode access 설정

2. MAC 주소 수 초과
   증상: 새 장비 연결 시 접속 불가
   해결: maximum 값 증가 또는 기존 MAC 삭제

3. 잘못된 MAC 주소 학습
   원인: 허브나 IP 폰 연결
   해결: 적절한 maximum 값 설정

4. Sticky MAC 문제
   증상: 장비 교체 후 접속 불가
   해결: 기존 sticky MAC 삭제 후 재학습
```

### 디버깅
```cisco
# 포트 보안 디버그
Switch# debug port-security

# 포트 보안 이벤트만
Switch# debug sw-vlan events

# 로그 메시지 확인
Switch# show logging | include PSECURE
```

### 모니터링 스크립트
```cisco
# EEM을 이용한 자동 대응
Switch(config)# event manager applet PORT_SECURITY_VIOLATION
Switch(config-applet)# event syslog pattern "PSECURE-2-PSECURE_VIOLATION"
Switch(config-applet)# action 1.0 cli command "show port-security"
Switch(config-applet)# action 2.0 syslog msg "Port security violation detected"
```

## 고급 포트 보안 기능

### 음성 VLAN과 포트 보안
```cisco
# IP 폰 + PC 환경
Switch(config)# interface fastethernet 0/5
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# switchport voice vlan 150

# 포트 보안 설정 (PC 1개 + IP폰 1개)
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 2
Switch(config-if)# switchport port-security mac-address sticky
Switch(config-if)# switchport port-security violation restrict
```

### 동적 VLAN 할당과 포트 보안
```cisco
# 802.1X와 함께 사용 시 주의사항
Switch(config)# interface fastethernet 0/6
Switch(config-if)# switchport mode access
Switch(config-if)# dot1x port-control auto

# 포트 보안 설정 (동적 VLAN 고려)
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 1
Switch(config-if)# switchport port-security mac-address sticky
```

## 포트 보안 모범 사례

### 설계 원칙
```
1. 적절한 최대 MAC 수 설정
   - 일반 PC: 1개
   - IP 폰 + PC: 2개
   - 소형 허브 연결: 3-5개
   - 프린터 서버: 2-3개

2. 위반 모드 선택 기준
   - 높은 보안: Shutdown 모드
   - 모니터링 중점: Restrict 모드
   - 서비스 연속성: Protect 모드

3. MAC 주소 학습 방식
   - 고정 환경: Static
   - 일반 사무실: Sticky  
   - 임시 연결: Dynamic

4. 에이징 설정
   - 동적 환경: Inactivity aging
   - 고정 환경: Absolute aging
   - 시간: 60-1440분 (1시간-1일)
```

### 보안 정책 예시
```
기본 정책:
- 모든 액세스 포트에 포트 보안 활성화
- 최대 MAC 주소: 포트별 요구사항에 따라
- 위반 모드: Restrict (모니터링 + 보안)
- MAC 학습: Sticky (편의성 + 보안)
- 에이징: 1440분 (24시간)

특수 포트:
- 서버 포트: Static MAC, Shutdown 모드
- 미사용 포트: Maximum 1, Shutdown 모드
- 게스트 포트: Dynamic MAC, Protect 모드
- 관리 포트: Static MAC, Shutdown 모드
```

### 구현 단계
```
1단계: 계획 수립
- 네트워크 토폴로지 분석
- 포트별 요구사항 정의
- 보안 정책 수립

2단계: 시험 적용
- 소규모 그룹에서 테스트
- 문제점 파악 및 해결
- 정책 수정

3단계: 점진적 확대
- 부서별/플로어별 적용
- 모니터링 및 조정
- 사용자 교육

4단계: 전체 적용
- 전사 정책 적용
- 지속적인 모니터링
- 정기적인 검토
```

## 다른 보안 기능과의 연계

### 802.1X와 조합
```cisco
# 인증과 MAC 제한 동시 적용
Switch(config)# interface fastethernet 0/10
Switch(config-if)# switchport mode access
Switch(config-if)# dot1x port-control auto
Switch(config-if)# switchport port-security
Switch(config-if)# switchport port-security maximum 1
```

### DHCP Snooping과 연계
```cisco
# MAC-IP 바인딩 강화
Switch(config)# ip dhcp snooping
Switch(config)# ip dhcp snooping vlan 10
Switch(config)# interface fastethernet 0/11
Switch(config-if)# ip dhcp snooping limit rate 10
Switch(config-if)# switchport port-security
```

### Dynamic ARP Inspection 연계
```
포트 보안 → DHCP Snooping → DAI 순서로 적용
각 단계에서 검증된 정보만 다음 단계로 전달
종합적인 Layer 2 보안 구축
```

## 성능 고려사항

### 성능 영향
```
CPU 사용률:
- MAC 주소 학습 시 추가 처리
- 위반 검사 오버헤드
- 일반적으로 미미한 영향

메모리 사용:
- 보안 MAC 주소 저장
- 포트별 설정 정보
- 스위치 용량에 따라 제한

처리 지연:
- 프레임별 MAC 검사
- 나노초 단위의 미미한 지연
- 실제 성능에 영향 없음
```

### 확장성 제한
```
시스템 제한:
- 전체 보안 MAC 주소 수
- 포트당 최대 MAC 수
- 스위치 모델별 상이

권장 지침:
- 시스템 한계의 80% 이하 사용
- 정기적인 사용량 모니터링
- 필요시 정적 MAC 주소 정리
```

## 관련 주제
- [[스위치 동작원리]] - 포트 보안의 기반 기술
- [[VLAN 구성]] - VLAN과 포트 보안 연동
- [[802.1X]] - 고급 포트 보안
- [[네트워크 보안]] - 종합적인 보안 전략

## 태그
#ccna #포트보안 #스위치보안 #맥주소 #네트워크보안 #접근제어
